cornreform/a7s-chan/firmware/sdkconfig.defaults
# ESP32-S3 M5Stack CoreS3 configuration
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_FIRMWARE_CHIP_ID=0x9

# PSRAM (8MB Octal PSRAM on CoreS3)
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_16KB=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_LINE_64B=y

# Flash
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# WiFi
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_RX_BA_WIN=6
CONFIG_ESP_WIFI_TASK_CORE_ID=1
CONFIG_ESP_WIFI_SOFTAP_BEACON_MAX_LEN=512
CONFIG_ESP_WIFI_SSID="SunnyWiFi"
CONFIG_ESP_WIFI_PASSWORD="password123"
CONFIG_ESP_WIFI_AUTHMODE_OPEN=y

# LWIP
CONFIG_LWIP_LOCAL_HOSTNAME="stack-chan"
CONFIG_LWIP_DNS_SUPPORT_MDNS_QUERIES=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TASK_FUNCTION_WRAPPER=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=n

# Compiler optimizations
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_RTTI=y

# Logging
CONFIG_LOG_MAXIMUM_LEVEL=4
CONFIG_LOG_COLORS=y

# Newlib (for PSRAM malloc)
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
# CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP is not set

# RMT (for IR and LEDs)
CONFIG_RMT_ENABLE_DEBUG_LOG=n

# I2S
CONFIG_I2S_ENABLE_DEBUG_LOG=n

# ESP-NOW (if needed later)
# CONFIG_ESP_WIFI_NET_SEND_IN_SEMAPHORE=y

# LWIP UDP
CONFIG_LWIP_UDP=y

# MDNS
CONFIG_MDNS_ENABLE_SERVICE_PRINT=n
